How to Customize the Keycloak "Continue" page
---------------------------------------------
Problem:  When using PKI authentication, the user is prompted with a "Continue" page
          I want to customize that page


Approaches:
 1) Create your own versions of templates using Freemarker syntax and add static content to it
 2) Extend the existing keycloak themes

Assumptions:
 A) You have downloaded installed keycloak-21.0.1
 B) You have Java 11 JDK installed  (to rebuild keycloak)



Procedure
---------
 1. Clone the keycloak-custom-theme project from my github site
    -- The built-in themes are found in this JAR:  $KEYCLOAK_HOME/lib/lib/main/org.keycloak.keycloak-themes-21.0.1.jar
    unix> git clone https://github.com/traderres/keycloak-custom-theme.git
    unix> cd keycloak-custom-theme

 2. Build the custom theme jar
    unix> mvn clean package

 3. Copy the jar to the $KEYCLOAK_HOME/providers directory
    unix> cp target/keycloak-custom-theme-1.0-SNAPSHOT.jar  $KEYCLOAK_HOME/providers

 4. Make sure you have Java 11 configured
    unix> export JAVA_HOME=/usr/java/jdk-11.0.12
    unix> export PATH=${JAVA_HOME}/bin:$PATH

 5. Rebuild the keycloak config  (requires Java 11 or later)
    unix> cd $KEYCLOAK_HOME
    unix> bin/kc.sh build

 6. Startup keycloak             (requires Java 11 or later)
    unix> cd $KEYCLOAK_HOME
    unix> bin/kc.sh start --http-enabled=false --https-port=8444 --https-key-store-file=/home/adam/intellijProjects/sf328/sf328-backend/src/main/prod_resources/localhost.localdomain.keystore.jks --https-key-store-type=JKS --https-key-store-password=changeit --https-trust-store-file=/home/adam/intellijProjects/sf328/sf328-backend/src/main/prod_resources/localhost.localdomain.truststore.jks --https-trust-store-type=JKS  --https-trust-store-password=changeit --https-client-auth=request  --log-level=INFO --hostname-strict-https=false --hostname-strict=false --hostname=localhost.localdomain

 7. Tell Keycloak to use your new theme
    a. Go to https://localhost.localdomain:8444
    b. Click on Administration Console
       Enter the username/password
    c. Select your realm
    d. Select your Clients -> your client
    e. Go to the "Settings" tab
    f. In Login Settings
       Change the Login theme:  my-custom-theme

 8. Connect to your webapp
    Go to https://localhost:8443/sf
    -- Spring Boot should redirect the user to keycloak
    -- Verify that your keycloak login page has your changes

